In [1]:
import pandas as pd

In [4]:
data= "data/wheat.csv"
df = pd.read_csv(data)

# １番

In [5]:
print(df.shape)
print(df.info())
display(df.head())

(369, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 369 entries, 0 to 368
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  369 non-null    object
 1   Element  369 non-null    object
 2   Unit     369 non-null    object
 3   Value    369 non-null    float64
dtypes: float64(1), object(3)
memory usage: 11.7+ KB
None

       Country         Element    Unit      Value
0  Afghanistan  Area harvested      ha  1635000.0
1  Afghanistan           Yield   hg/ha    22100.0
2  Afghanistan      Production  tonnes  3613300.0
3      Albania  Area harvested      ha    65072.0
4      Albania           Yield   hg/ha    36927.0

# ２番

In [8]:
df2 = df[df['Element'] == 'Yield']
df2.head()

        Country Element   Unit    Value
1   Afghanistan   Yield  hg/ha  22100.0
4       Albania   Yield  hg/ha  36927.0
7       Algeria   Yield  hg/ha  19076.0
10       Angola   Yield  hg/ha  10935.0
13    Argentina   Yield  hg/ha  31806.0

# ３番

In [9]:
round(df2['Value'].mean())

31800

# ４番

In [10]:
df2_sorted = df2.sort_values(by='Value', ascending=False).reset_index(drop=True)
df2_sorted.head(10)

                                             Country Element   Unit    Value
0                                        New Zealand   Yield  hg/ha  89596.0
1                                        Netherlands   Yield  hg/ha  88212.0
2                                            Ireland   Yield  hg/ha  87379.0
3                                            Belgium   Yield  hg/ha  84434.0
4  United Kingdom of Great Britain and Northern I...   Yield  hg/ha  77546.0
5                                             France   Yield  hg/ha  68427.0
6                                              Egypt   Yield  hg/ha  66895.0
7                                            Germany   Yield  hg/ha  66737.0
8                                       Saudi Arabia   Yield  hg/ha  65334.0
9                                            Denmark   Yield  hg/ha  62348.0

# ５番

In [17]:
japan_data = df2_sorted[df2_sorted['Country'] == 'Japan']

print(japan_data.iloc[0]['Value'])
print(japan_data.index[0]+1)

36097.0
40

# ６番

In [19]:
df2_sorted.drop(columns=['Element'])
df2_sorted.head()

                                             Country Element   Unit    Value
0                                        New Zealand   Yield  hg/ha  89596.0
1                                        Netherlands   Yield  hg/ha  88212.0
2                                            Ireland   Yield  hg/ha  87379.0
3                                            Belgium   Yield  hg/ha  84434.0
4  United Kingdom of Great Britain and Northern I...   Yield  hg/ha  77546.0

# ７番

In [20]:
df2_sorted.to_csv("wheat_yield_sorted.csv")